; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	thermograph1 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star3 - direction
	Star1 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 112)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star3)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 187)
	(supports instrument5 infrared2)
	(calibration_target instrument5 Star1)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 125)
	(= (data Star4 thermograph1) 234)
	(= (data Phenomenon5 thermograph1) 205)
	(= (data Planet6 thermograph1) 277)
	(= (data Star7 thermograph1) 240)
	(= (data Phenomenon8 thermograph1) 216)
	(= (data Star9 thermograph1) 144)
	(= (data Star4 spectrograph0) 142)
	(= (data Phenomenon5 spectrograph0) 38)
	(= (data Planet6 spectrograph0) 280)
	(= (data Star7 spectrograph0) 263)
	(= (data Phenomenon8 spectrograph0) 171)
	(= (data Star9 spectrograph0) 125)
	(= (data Star4 infrared2) 211)
	(= (data Phenomenon5 infrared2) 135)
	(= (data Planet6 infrared2) 70)
	(= (data Star7 infrared2) 117)
	(= (data Phenomenon8 infrared2) 253)
	(= (data Star9 infrared2) 28)
	(= (slew_time Star3 GroundStation0) 3.192)
	(= (slew_time GroundStation0 Star3) 3.192)
	(= (slew_time Star3 Star1) 73.97)
	(= (slew_time Star1 Star3) 73.97)
	(= (slew_time Star3 GroundStation2) 21.86)
	(= (slew_time GroundStation2 Star3) 21.86)
	(= (slew_time Star1 GroundStation0) 57.29)
	(= (slew_time GroundStation0 Star1) 57.29)
	(= (slew_time GroundStation2 GroundStation0) 22.98)
	(= (slew_time GroundStation0 GroundStation2) 22.98)
	(= (slew_time GroundStation2 Star1) 26.5)
	(= (slew_time Star1 GroundStation2) 26.5)
	(= (slew_time Star4 GroundStation0) 27)
	(= (slew_time GroundStation0 Star4) 27)
	(= (slew_time Star4 Star1) 10.24)
	(= (slew_time Star1 Star4) 10.24)
	(= (slew_time Star4 GroundStation2) 40.34)
	(= (slew_time GroundStation2 Star4) 40.34)
	(= (slew_time Star4 Star3) 37.86)
	(= (slew_time Star3 Star4) 37.86)
	(= (slew_time Phenomenon5 GroundStation0) 21.97)
	(= (slew_time GroundStation0 Phenomenon5) 21.97)
	(= (slew_time Phenomenon5 Star1) 2.973)
	(= (slew_time Star1 Phenomenon5) 2.973)
	(= (slew_time Phenomenon5 GroundStation2) 72.72)
	(= (slew_time GroundStation2 Phenomenon5) 72.72)
	(= (slew_time Phenomenon5 Star3) 39.47)
	(= (slew_time Star3 Phenomenon5) 39.47)
	(= (slew_time Phenomenon5 Star4) 73.04)
	(= (slew_time Star4 Phenomenon5) 73.04)
	(= (slew_time Planet6 GroundStation0) 28.97)
	(= (slew_time GroundStation0 Planet6) 28.97)
	(= (slew_time Planet6 Star1) 3.729)
	(= (slew_time Star1 Planet6) 3.729)
	(= (slew_time Planet6 GroundStation2) 36.09)
	(= (slew_time GroundStation2 Planet6) 36.09)
	(= (slew_time Planet6 Star3) 10.82)
	(= (slew_time Star3 Planet6) 10.82)
	(= (slew_time Planet6 Star4) 43.72)
	(= (slew_time Star4 Planet6) 43.72)
	(= (slew_time Planet6 Phenomenon5) 36.08)
	(= (slew_time Phenomenon5 Planet6) 36.08)
	(= (slew_time Star7 GroundStation0) 49.99)
	(= (slew_time GroundStation0 Star7) 49.99)
	(= (slew_time Star7 Star1) 59.15)
	(= (slew_time Star1 Star7) 59.15)
	(= (slew_time Star7 GroundStation2) 13.09)
	(= (slew_time GroundStation2 Star7) 13.09)
	(= (slew_time Star7 Star3) 29.96)
	(= (slew_time Star3 Star7) 29.96)
	(= (slew_time Star7 Star4) 27.03)
	(= (slew_time Star4 Star7) 27.03)
	(= (slew_time Star7 Phenomenon5) 13.84)
	(= (slew_time Phenomenon5 Star7) 13.84)
	(= (slew_time Star7 Planet6) 14.62)
	(= (slew_time Planet6 Star7) 14.62)
	(= (slew_time Phenomenon8 GroundStation0) 52.72)
	(= (slew_time GroundStation0 Phenomenon8) 52.72)
	(= (slew_time Phenomenon8 Star1) 39.86)
	(= (slew_time Star1 Phenomenon8) 39.86)
	(= (slew_time Phenomenon8 GroundStation2) 3.104)
	(= (slew_time GroundStation2 Phenomenon8) 3.104)
	(= (slew_time Phenomenon8 Star3) 8.401)
	(= (slew_time Star3 Phenomenon8) 8.401)
	(= (slew_time Phenomenon8 Star4) 35.78)
	(= (slew_time Star4 Phenomenon8) 35.78)
	(= (slew_time Phenomenon8 Phenomenon5) 54.3)
	(= (slew_time Phenomenon5 Phenomenon8) 54.3)
	(= (slew_time Phenomenon8 Planet6) 20.49)
	(= (slew_time Planet6 Phenomenon8) 20.49)
	(= (slew_time Phenomenon8 Star7) 19.29)
	(= (slew_time Star7 Phenomenon8) 19.29)
	(= (slew_time Star9 GroundStation0) 32.48)
	(= (slew_time GroundStation0 Star9) 32.48)
	(= (slew_time Star9 Star1) 43.87)
	(= (slew_time Star1 Star9) 43.87)
	(= (slew_time Star9 GroundStation2) 52.73)
	(= (slew_time GroundStation2 Star9) 52.73)
	(= (slew_time Star9 Star3) 56.99)
	(= (slew_time Star3 Star9) 56.99)
	(= (slew_time Star9 Star4) 4.158)
	(= (slew_time Star4 Star9) 4.158)
	(= (slew_time Star9 Phenomenon5) 59.95)
	(= (slew_time Phenomenon5 Star9) 59.95)
	(= (slew_time Star9 Planet6) 64.97)
	(= (slew_time Planet6 Star9) 64.97)
	(= (slew_time Star9 Star7) 17.99)
	(= (slew_time Star7 Star9) 17.99)
	(= (slew_time Star9 Phenomenon8) 19.34)
	(= (slew_time Phenomenon8 Star9) 19.34)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite2 Phenomenon8)
	(have_image Phenomenon5 spectrograph0)
	(have_image Planet6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Phenomenon8 infrared2)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite2 phenomenon8 planet6)
   deleted: (pointing satellite2 planet6)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 125 to 104.51, (fuel-used) from 0 to 20.49
   goals met: 1 of 5
2. (turn_to satellite2 groundstation2 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 104.51 to 101.406, (fuel-used) from 20.49 to 23.594
   goals met: 0 of 5
3. (turn_to satellite2 phenomenon8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 101.406 to 98.302, (fuel-used) from 23.594 to 26.698
   goals met: 1 of 5
4. (turn_to satellite2 groundstation2 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 98.302 to 95.198, (fuel-used) from 26.698 to 29.802
   goals met: 0 of 5
5. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 187 to 183.271, (fuel-used) from 29.802 to 33.531
   goals met: 0 of 5
6. (turn_to satellite1 star1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 183.271 to 179.542, (fuel-used) from 33.531 to 37.26
   goals met: 0 of 5
7. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 179.542 to 175.813, (fuel-used) from 37.26 to 40.989
   goals met: 0 of 5
8. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
9. (turn_to satellite1 phenomenon5 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 175.813 to 139.733, (fuel-used) from 40.989 to 77.069
   goals met: 0 of 5
10. (turn_to satellite1 planet6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 139.733 to 103.653, (fuel-used) from 77.069 to 113.149
   goals met: 0 of 5
11. (turn_to satellite1 star1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 103.653 to 99.924, (fuel-used) from 113.149 to 116.878
   goals met: 0 of 5
12. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 99.924 to 96.195, (fuel-used) from 116.878 to 120.607
   goals met: 0 of 5
13. (turn_to satellite1 star1 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 96.195 to 92.466, (fuel-used) from 120.607 to 124.336
   goals met: 0 of 5
14. (turn_to satellite2 phenomenon8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 95.198 to 92.094, (fuel-used) from 124.336 to 127.44
   goals met: 1 of 5
15. (turn_to satellite1 groundstation0 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 groundstation0)
   changed: (fuel satellite1) from 92.466 to 35.176, (fuel-used) from 127.44 to 184.73
   goals met: 1 of 5
16. (calibrate satellite1 instrument3 groundstation0)
   added: (calibrated instrument3)
   goals met: 1 of 5
17. (turn_to satellite1 phenomenon5 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 35.176 to 13.206, (fuel-used) from 184.73 to 206.7
   goals met: 1 of 5
18. (take_image satellite1 phenomenon5 instrument3 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   changed: (data_capacity satellite1) from 1000 to 962, (data-stored) from 0 to 38
   goals met: 2 of 5
19. (turn_to satellite1 star1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 star1)
   changed: (fuel satellite1) from 13.206 to 10.233, (fuel-used) from 206.7 to 209.673
   goals met: 2 of 5
20. (turn_to satellite1 planet6 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 10.233 to 6.504, (fuel-used) from 209.673 to 213.402
   goals met: 2 of 5
21. (take_image satellite1 planet6 instrument3 spectrograph0)
   added: (have_image planet6 spectrograph0)
   changed: (data_capacity satellite1) from 962 to 682, (data-stored) from 38 to 318
   goals met: 3 of 5
22. (turn_to satellite2 star7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 92.094 to 72.804, (fuel-used) from 213.402 to 232.692
   goals met: 2 of 5
23. (turn_to satellite2 phenomenon8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 72.804 to 53.514, (fuel-used) from 232.692 to 251.982
   goals met: 3 of 5
24. (turn_to satellite2 groundstation2 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 groundstation2)
   changed: (fuel satellite2) from 53.514 to 50.41, (fuel-used) from 251.982 to 255.086
   goals met: 2 of 5
25. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 2 of 5
26. (calibrate satellite2 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 2 of 5
27. (turn_to satellite2 phenomenon8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 50.41 to 47.306, (fuel-used) from 255.086 to 258.19
   goals met: 3 of 5
28. (turn_to satellite2 star7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 47.306 to 28.016, (fuel-used) from 258.19 to 277.48
   goals met: 2 of 5
29. (take_image satellite2 star7 instrument6 spectrograph0)
   added: (have_image star7 spectrograph0)
   changed: (data_capacity satellite2) from 1000 to 737, (data-stored) from 318 to 581
   goals met: 3 of 5
30. (turn_to satellite2 phenomenon8 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon8)
   changed: (fuel satellite2) from 28.016 to 8.726, (fuel-used) from 277.48 to 296.77
   goals met: 4 of 5
31. (take_image satellite2 phenomenon8 instrument6 infrared2)
   added: (have_image phenomenon8 infrared2)
   changed: (data_capacity satellite2) from 737 to 484, (data-stored) from 581 to 834
   goals met: 5 of 5
